Revit 2026 API

# PaperSizeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperSizeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
PaperSizeSetIterator()
```
```fsharp
new : unit -> PaperSizeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

PaperSizeSetIterator Class

Autodesk.Revit.DB Namespace